logs/benchmark_2mw(2017-11-18_03h11)/ratio_0:1/sharded_false/workers_16/clients_24/client_1_1_2.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  90 secs]  0 threads:      445303 ops,    5194 (avg:    4947) ops/sec, 5.31MB/sec (avg: 5.07MB/sec),  4.60 (avg:  4.84) msec latency

1         Threads
24        Connections per thread
90        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets           0.00          ---          ---      0.00000         0.00
Gets        5003.34      4994.78         8.56      4.84200      5247.57
Waits          0.00          ---          ---      0.00000          ---
Totals      5003.34      4994.78         8.56      4.84200      5247.57


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
---
GET       1.100         0.00
GET       1.200         0.00
GET       1.300         0.02
GET       1.400         0.11
GET       1.500         0.37
GET       1.600         0.92
GET       1.700         1.83
GET       1.800         3.27
GET       1.900         5.21
GET       2.000         7.82
GET       2.100        11.16
GET       2.200        15.23
GET       2.300        19.86
GET       2.400        24.58
GET       2.500        29.42
GET       2.600        34.27
GET       2.700        38.91
GET       2.800        43.20
GET       2.900        47.05
GET       3.000        50.49
GET       3.100        53.45
GET       3.200        55.84
GET       3.300        57.83
GET       3.400        59.50
GET       3.500        60.81
GET       3.600        61.85
GET       3.700        62.71
GET       3.800        63.40
GET       3.900        63.98
GET       4.000        64.47
GET       4.100        64.85
GET       4.200        65.19
GET       4.300        65.49
GET       4.400        65.77
GET       4.500        66.02
GET       4.600        66.28
GET       4.700        66.50
GET       4.800        66.72
GET       4.900        66.92
GET       5.000        67.11
GET       5.100        67.31
GET       5.200        67.51
GET       5.300        67.69
GET       5.400        67.89
GET       5.500        68.09
GET       5.600        68.28
GET       5.700        68.47
GET       5.800        68.66
GET       5.900        68.86
GET       6.000        69.07
GET       6.100        69.26
GET       6.200        69.47
GET       6.300        69.67
GET       6.400        69.88
GET       6.500        70.08
GET       6.600        70.26
GET       6.700        70.45
GET       6.800        70.65
GET       6.900        70.85
GET       7.000        71.04
GET       7.100        71.23
GET       7.200        71.45
GET       7.300        71.67
GET       7.400        71.88
GET       7.500        72.13
GET       7.600        72.37
GET       7.700        72.64
GET       7.800        72.93
GET       7.900        73.24
GET       8.000        73.56
GET       8.100        73.94
GET       8.200        74.33
GET       8.300        74.77
GET       8.400        75.26
GET       8.500        75.82
GET       8.600        76.44
GET       8.700        77.12
GET       8.800        77.88
GET       8.900        78.75
GET       9.000        79.68
GET       9.100        80.68
GET       9.200        81.72
GET       9.300        82.90
GET       9.400        84.08
GET       9.500        85.27
GET       9.600        86.48
GET       9.700        87.64
GET       9.800        88.81
GET       9.900        90.01
GET      10.000        95.23
GET      11.000        98.71
GET      12.000        99.42
GET      13.000        99.70
GET      14.000        99.81
GET      15.000        99.88
GET      16.000        99.92
GET      17.000        99.95
GET      18.000        99.97
GET      19.000        99.98
GET      20.000        99.99
GET      21.000        99.99
GET      22.000        99.99
GET      23.000       100.00
GET      24.000       100.00
GET      25.000       100.00
GET      26.000       100.00
GET      30.000       100.00
GET      31.000       100.00
GET      36.000       100.00
---